public/man/man1/flatpak-repair.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-repair.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-repair.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-repair - Repair a flatpak installation</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak repair</strong> [OPTION…]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Repair a flatpak installation by pruning and reinstalling invalid
objects. The repair command does all of the following:</p>
<blockquote>
<p>·</p>
<p>
Scan all locally available refs, removing any that dont correspond to a
deployed ref.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Verify each commit they point to, removing any invalid objects and
noting any missing objects.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Remove any refs that had an invalid object, and any non-partial refs
that had missing objects.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Prune all objects not referenced by a ref, which gets rid of any
possibly invalid non-scanned objects.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Enumerate all deployed refs and re-install any that are not in the repo
(or are partial for a non-subdir deploy).</p>
</blockquote>
<p>
Note that <strong>flatpak repair</strong> has to be run with root privileges to operate
on the system installation.</p>
<p>
An alternative command for repairing OSTree repositories is ostree fsck.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-u</strong>, <strong>–user</strong></p>
<blockquote>
<p>Repair per-user installation.</p>
</blockquote>
<p>
<strong>–system</strong></p>
<blockquote>
<p>Repair system-wide installation.</p>
</blockquote>
<p>
<strong>–installation=NAME</strong></p>
<blockquote>
<p>Repair the system-wide installation specified by NAME among those
defined in <em>etc/flatpak/installations.d</em>. Using –installation=default
is equivalent to using –system.</p>
</blockquote>
<p>
<strong>–dry-run</strong></p>
<blockquote>
<p>Only report inconsistencies, dont make any changes</p>
</blockquote>
<p>
<strong>–reinstall-all</strong></p>
<blockquote>
<p>Reinstall all refs, regardless of whether they were removed from the
repo or not</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>$ sudo flatpak repair</strong></p>
<p>
<strong>$ flatpak repair –user</strong></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*flatpak*(1), *ostree-fsck*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
